thon.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-30 Sat 22:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Evan Bergeron" />
<link rel="stylesheet" type="text/css" href="no.css" />
</head>
<body>
<div id="content">

<div id="outline-container-org2fa0ef8" class="outline-2">
<h2 id="org2fa0ef8">thon is a programming language.</h2>
<div class="outline-text-2" id="text-org2fa0ef8">
<p>
thon is a small programming language. Here's an example program that
verifies the empty list is empty.
</p>

<pre class="example">
fun isempty : (data l = (unit | nat * l)) -&gt; nat =
  \ natlist : (data l = (unit | nat * l)) -&gt;
        (case (unfold natlist) of
           empty -&gt; S Z
         | not -&gt; Z)
in let nil : (data l = (unit | nat * l)) =
    fold data l = (unit | nat * l) with
    left unit : (unit
               | nat * (data l = (unit | nat * l)))
in
(isempty nil)
</pre>

<p>
thon has natural numbers, functions, recursion, binary product and sum
types, polymorphism, existential packages (a formalization of
interfaces), and recursive types.
</p>
</div>

<div id="outline-container-org9db17fe" class="outline-3">
<h3 id="natural-numbers"><a id="org9db17fe"></a>natural numbers</h3>
<div class="outline-text-3" id="text-natural-numbers">
<p>
<code>Z</code> is the natural number 0. <code>S Z</code> is 1 (the succesor of one). <code>S S Z</code>
is 2, and so on.
</p>
</div>
</div>

<div id="outline-container-orga15c885" class="outline-3">
<h3 id="functions"><a id="orga15c885"></a>functions</h3>
<div class="outline-text-3" id="text-functions">
<p>
In thon, functions are expressions just like numbers are. thon supports
anonymous functions and named, recursive functions.
</p>

<p>
Here are some example anonymous functions.
</p>

<pre class="example">
\ x : nat -&gt; x
\ x : nat -&gt; (\ y : nat -&gt; y)
</pre>

<p>
Functions are applied to their arguments by juxtaposition.
</p>

<pre class="example">
((\ x : nat -&gt; x) Z)
</pre>

<p>
Here's a divide-by-two function:
</p>

<pre class="example">
fun divbytwo : nat -&gt; nat =
  \ n : nat -&gt;
    ifz n of
      Z -&gt; Z
    | S p -&gt; ifz p of Z -&gt; Z | S p' -&gt; (S (divbytwo p'))
in divbytwo (S S S S Z)
</pre>

<p>
If the number is zero, we're done. Otherwise, it has some predecessor
number <code>p</code>. If <code>p</code> is zero, then return zero (taking the floor).
Otherwise, recurse on the predecessor of the predecessor <code>n-2</code> and add
one to whatever that gave us.
</p>

<p>
Under the hood, recursive functions are implemented as a fixed point
expression that substitutes itself in for itself. It's like a recursive
function, but it doesn't have to be a function, it can be any
expression. Here's an amusing way to loop forever:
</p>

<pre class="example">
fix loop : nat in loop
</pre>
</div>
</div>

<div id="outline-container-org6f63f0f" class="outline-3">
<h3 id="variables"><a id="org6f63f0f"></a>variables</h3>
<div class="outline-text-3" id="text-variables">
<pre class="example">
let x : nat = Z in x
</pre>

<p>
binds the name <code>x</code> in the expression following the <code>in</code> keyword.
</p>
</div>
</div>

<div id="outline-container-orga231d97" class="outline-3">
<h3 id="polymorphism"><a id="orga231d97"></a>polymorphism</h3>
<div class="outline-text-3" id="text-polymorphism">
<p>
Polymorphism lets us reuse code you wrote for many different types, with
the guarantee that the code will behave the same for all types.
</p>

<pre class="example">
poly t -&gt; \ x : t -&gt; x
</pre>

<p>
is the polymorphic identity function. Feed it a type to get the identity
function on that type. e.g.
</p>

<pre class="example">
(poly t -&gt; \ x : t -&gt; x) nat
</pre>

<p>
evaluates to the identity function on natural numbers.
</p>
</div>
</div>

<div id="outline-container-orgfd98838" class="outline-3">
<h3 id="existential-packages-hide-types"><a id="orgfd98838"></a>existential packages hide types</h3>
<div class="outline-text-3" id="text-existential-packages-hide-types">
<p>
They let us write a piece of code with a private implementation type.
Clients that use this implementation don't know what type was used. This
property is enforced by the type system.
</p>

<p>
Ok, so how do we use them in thon? Let's consider a sort-of-silly
example.
</p>

<p>
The interface is just "set" and "get." We feed in a number, get a number
back. However the implementation stores the number is up to them.
</p>

<p>
We have two implementations with two separate implementation types. The
first just holds on to the number.
</p>

<pre class="example">
((*set*) \ x : nat -&gt; x,
 (*get*) \ x : nat -&gt; x)
</pre>

<p>
The second stores in the number in a tuple (for no real good reason -
you didn't write this code, it's not your fault it does it this way).
</p>

<pre class="example">
((*set*) \ x : nat -&gt; (x, Z),
 (*get*) \ tup : (nat * nat) -&gt; fst tup)
</pre>

<p>
Now each of these implementations can be packed away with the syntax
</p>

<pre class="example">
impl some t. ((nat -&gt; t) * (t -&gt; nat)) with nat as
(
    ((*set*) \ x : nat -&gt; x,
    (*get*) \ x : nat -&gt; x)
)
</pre>

<p>
and
</p>

<pre class="example">
impl some t. ((nat -&gt; t) * (t -&gt; nat)) with (nat, nat) as
(
    ((*set*) \ x : nat -&gt; (x, Z),
    (*get*) \ tup : (nat * nat) -&gt; fst tup)
)
</pre>

<p>
Both of these expression have type <code>((nat -&gt; T) * (T -&gt; nat))</code> for some
type <code>T</code>. Note this is an existential claim, hence the name existential
packages.
</p>

<p>
An implementation can be used as follows:
</p>

<pre class="example">
let setget : some t. ((nat -&gt; t) * (t -&gt; nat)) =
    (impl some t. ((nat -&gt; t) * (t -&gt; nat)) with nat as
    (
        ((*set*) \ x : nat -&gt; x,
        (*get*) \ x : nat -&gt; x)
     ))
in use setget as (sg, t) in
let set : (nat -&gt; t) = fst sg in
let get : (t -&gt; nat) = snd sg in
let s : t = set (S S Z) in
let g : nat = get s in
g
</pre>

<p>
Note that since the type variable <code>t</code> declared in the <code>use</code> clause is
abstract, we can equivalently use the other implementation.
</p>
</div>
</div>

<div id="outline-container-orgce9a37a" class="outline-3">
<h3 id="recursive-types"><a id="orgce9a37a"></a>recursive types</h3>
<div class="outline-text-3" id="text-recursive-types">
<p>
<code>data nats = (unit | (nat * nats))</code> is the type of lists natural
numbers.
</p>

<pre class="example">
fold data nats = (unit | (nat * nats))
with left unit : (unit | (nat * (data nats = (unit | (nat * nats)))))
</pre>

<p>
is the empty list of natural numbers.
</p>

<pre class="example">
\ (nat * (data nats = (unit | nat * nats))) -&gt;
   fold data nats = (unit | nat * nats) with
   right 0 : (unit | nat * (data nats = (unit | nat * nats)))
</pre>

<p>
is a function that takes a pair (nat, natlist) and prepends nat to
natlist.
</p>
</div>
</div>

<div id="outline-container-orgd6daafd" class="outline-3">
<h3 id="thanks"><a id="orgd6daafd"></a>thanks</h3>
<div class="outline-text-3" id="text-thanks">
<p>
I've mostly been working out of Bob Harper's "Practical Foundations for
Programming Languages," though Pierce's "Types and Programming
Languages" has been a useful source of examples and exposition as well.
I am also grateful to Rob Simmons and every other contributor to the SML
starter code for CMU's Fall 2016 compilers course.
</p>
</div>
</div>

<div id="outline-container-org93d3da1" class="outline-3">
<h3 id="install-ubuntu-20"><a id="org93d3da1"></a>install (ubuntu 20)</h3>
<div class="outline-text-3" id="text-install-ubuntu-20">
<p>
Wow, you read this far! (or scrolled this far, at least) If you'd like
to program in thon, the code is publicly available.
</p>

<pre class="example">
$ git clone https://git.sr.ht/~thon/thon
$ sudo apt install smlnj ml-yaxx ml-lex ml-lpt
$ sml
- CM.make "path/to/your/git/clone/thon.cm";
- Thon.run "some thon program here";
</pre>

<p>
If you figure out install instructions on mac or windows or have any
other questions or comments, please email me at bergeronej@gmail.com. I
would love to hear from you!
</p>
</div>
</div>

<div id="outline-container-orga856cc7" class="outline-3">
<h3 id="collatz-conjecture"><a id="orga856cc7"></a>collatz conjecture</h3>
<div class="outline-text-3" id="text-collatz-conjecture">
<p>
A fun program I wrote after adding recursion. Pretty much all the code
I've written in thon is available through the git repo.
</p>

<pre class="example">
let isone : nat -&gt; nat = 
  \ n : nat -&gt;
    ifz n of
      Z -&gt; Z (*false*)
    | S p -&gt; ifz p of Z -&gt; S Z | S p -&gt; Z
in fun iseven : nat -&gt; nat =
  \ n : nat -&gt;
    ifz n of
      Z -&gt; S Z (*true*)
    | S p -&gt; ifz (iseven p) of Z -&gt; S Z | S p -&gt; Z
in fun divbytwo : nat -&gt; nat =
  \ n : nat -&gt;
    ifz n of
      Z -&gt; Z
    | S p -&gt; ifz p of Z -&gt; Z | S p' -&gt; (S (divbytwo p'))
in fun multbythree : nat -&gt; nat =
  \ n : nat -&gt;
    ifz n of
      Z -&gt; Z
   | S nminusone -&gt; S S S (multbythree nminusone)
in fun collatz : nat -&gt; nat =
  \ n : nat -&gt;
    ifz (isone n) of
      Z -&gt; (
        ifz (iseven n) of
          Z -&gt; collatz (S (multbythree n))
        | S p -&gt; (collatz (divbytwo n))
      )
    | S p -&gt; (S Z)
in (collatz (S S Z))
</pre>

<p>
<a href="https://xkcd.com/710/">relevant xkcd</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
